In [35]:
import pandas as pd
import numpy as np

In [36]:
date = pd.read_csv('C:/Users/ASUS/Machine_Learning/100_Days_Of _Machine_Learning/Feature_Engineering/Datasets/orders.csv')
time = pd.read_csv('C:/Users/ASUS/Machine_Learning/100_Days_Of _Machine_Learning/Feature_Engineering/Datasets/messages.csv')

In [37]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [38]:
time.tail()

                    date                                                msg
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

In [39]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

<h2 style = 'color:blue'>Working with Dates<h/2>

In [40]:
date['date'] = pd.to_datetime(date['date'])

In [41]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### Extract year

In [42]:
date['date_year'] = date.date.dt.year
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

### Extract month

In [43]:
date['date_mon_no'] = date.date.dt.month
date.head()

        date  product_id  city_id  orders  date_year  date_mon_no
0 2019-12-10        5628       25       3       2019           12
1 2018-08-15        3646       14     157       2018            8
2 2018-10-23        1859       25       1       2018           10
3 2019-08-17        7292       25       1       2019            8
4 2019-01-06        4344       25       3       2019            1

In [44]:
date['date_mon_name'] = date.date.dt.month_name()
date.head()

,date,product_id,city_id,orders,date_year,date_mon_no,date_mon_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [45]:
date.drop(columns=['product_id','city_id','orders'],inplace = True)

### Extract days

In [46]:
date['date_day'] = date.date.dt.day
date.head()

        date  date_year  date_mon_no date_mon_name  date_day
0 2019-12-10       2019           12      December        10
1 2018-08-15       2018            8        August        15
2 2018-10-23       2018           10       October        23
3 2019-08-17       2019            8        August        17
4 2019-01-06       2019            1       January         6

In [47]:
date['date_dow'] = date.date.dt.dayofweek
date.head()

        date  date_year  date_mon_no date_mon_name  date_day  date_dow
0 2019-12-10       2019           12      December        10         1
1 2018-08-15       2018            8        August        15         2
2 2018-10-23       2018           10       October        23         1
3 2019-08-17       2019            8        August        17         5
4 2019-01-06       2019            1       January         6         6

In [49]:

date['date_dow_name'] = date['date'].dt.day_name()
date.head()

,date,date_year,date_mon_no,date_mon_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [52]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.head()

,date,date_year,date_mon_no,date_mon_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

### Extract week of the year

In [56]:
date['date_week'] = date.date.dt.weekday
date.head()

,date,date_year,date_mon_no,date_mon_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1
3,2019-08-17,2019,8,August,17,5,Saturday,1,5
4,2019-01-06,2019,1,January,6,6,Sunday,1,6

### Extract Quarter

In [59]:
date['quarter'] = date.date.dt.quarter
date.head()

,date,date_year,date_mon_no,date_mon_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1

### Extract Semester

In [62]:
date['semester'] = np.where(date.quarter.isin([1,2]),1,2)
date.head()

,date,date_year,date_mon_no,date_mon_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1,1

<h2 style="color:blue">Extract Time elapsed between dates</h2>

In [87]:
import datetime

In [88]:
today = datetime.datetime.today()
today

datetime.datetime(2024, 3, 22, 20, 52, 33, 324680)

In [89]:
today - date['date']

0     1564 days 20:52:33.324680
1     2046 days 20:52:33.324680
2     1977 days 20:52:33.324680
3     1679 days 20:52:33.324680
4     1902 days 20:52:33.324680
                 ...
995   1992 days 20:52:33.324680
996   1933 days 20:52:33.324680
997   1781 days 20:52:33.324680
998   1846 days 20:52:33.324680
999   1620 days 20:52:33.324680
Name: date, Length: 1000, dtype: timedelta64[ns]

In [90]:
(today - date['date']).dt.days

0      1564
1      2046
2      1977
3      1679
4      1902
       ...
995    1992
996    1933
997    1781
998    1846
999    1620
Name: date, Length: 1000, dtype: int64

In [92]:
(today -date['date'])

0     1564 days 20:52:33.324680
1     2046 days 20:52:33.324680
2     1977 days 20:52:33.324680
3     1679 days 20:52:33.324680
4     1902 days 20:52:33.324680
                 ...
995   1992 days 20:52:33.324680
996   1933 days 20:52:33.324680
997   1781 days 20:52:33.324680
998   1846 days 20:52:33.324680
999   1620 days 20:52:33.324680
Name: date, Length: 1000, dtype: timedelta64[ns]

In [96]:
((today - date['date']).dt.days) / 30.44

0      51.379763
1      67.214192
2      64.947438
3      55.157687
4      62.483574
         ...
995    65.440210
996    63.501971
997    58.508541
998    60.643890
999    53.219448
Name: date, Length: 1000, dtype: float64

<h2 style = 'color:blue'>Working with time<h/2>

In [98]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [97]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [100]:
type(pd.to_datetime(time.date))

pandas.core.series.Series

In [101]:
time['date'] = pd.to_datetime(time.date)

In [102]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [104]:
time['hour'] = time.date.dt.hour
time['min'] = time.date.dt.minute
time['sec'] = time.date.dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [108]:
time['time'] = time.date.dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [109]:
today - time['date']

0     3750 days 20:04:49.078275
1     3614 days 21:14:49.078275
2     4100 days 20:33:49.078275
3     3402 days 20:23:49.078275
4     3799 days 21:43:49.078275
                 ...
995   4389 days 20:04:49.078275
996   3710 days 21:40:49.078275
997   4175 days 21:17:49.078275
998   4291 days 21:20:49.078275
999   3563 days 21:29:49.078275
Name: date, Length: 1000, dtype: timedelta64[ns]

In [110]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.240723e+08
1      3.123261e+08
2      3.543140e+08
3      2.940062e+08
4      3.283118e+08
           ...
995    3.792819e+08
996    3.206220e+08
997    3.607967e+08
998    3.708192e+08
999    3.079206e+08
Name: date, Length: 1000, dtype: float64

In [111]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.401205e+06
1      5.205435e+06
2      5.905234e+06
3      4.900104e+06
4      5.471864e+06
           ...
995    6.321365e+06
996    5.343701e+06
997    6.013278e+06
998    6.180321e+06
999    5.132010e+06
Name: date, Length: 1000, dtype: float64

In [112]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       90020.080300
1       86757.246966
2       98420.563633
3       81668.396966
4       91197.730300
           ...
995    105356.080300
996     89061.680300
997    100221.296966
998    103005.346966
999     85533.496966
Name: date, Length: 1000, dtype: float64